"""
1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
до минуты: <s> сек;
* до часа: <m> мин <s> сек;
* до суток: <h> час <m> мин <s> сек;
* *до месяца, до года, больше года: по аналогии.
"""


# duration = int(input('Введите количество секунд: ')) #вводим количество минут
# sec = (duration % 3600) % 60 #извлекаем остаток секунд
# minute = (duration % 3600) // 60 #извлекаем минуты
# hour = duration // 3600 #часы
# print('до минуты:', sec, 'сек;')
# print('до часа:', minute, 'мин', sec, 'сек;')
# print('до суток:', hour, 'час', minute, 'мин', sec, 'сек;')


"""
2. Создать список, состоящий из кубов нечётных чисел от 0 до 1000:
Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7. 
Например, число «19 ^ 3 = 6859» будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7. 
Внимание: использовать только арифметические операции!
К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого списка, 
сумма цифр которых делится нацело на 7. Внимание: новый список не создавать!!!
"""

# for s in (0, 17):
#     numbers_range = []
#
#     total_summ = 0
#     for number in range(1, 1001, 2):
#         numbers_range.append((number ** 3) + s)
#     # print(numbers_range)
#     for numbers in numbers_range:
#         _n = numbers
#         number_sum = 0
#         while numbers:
#             number_sum += numbers % 10
#             numbers = numbers // 10
#         if (number_sum % 7) == 0:
#             total_summ += _n
#     print(total_summ)

"""
3. Реализовать склонение слова «процент» для чисел до 20. Например, задаем число 5 — получаем «5 процентов», 
задаем число 2 — получаем «2 процента». Вывести все склонения для проверки
"""

# input_number = [1, 2, 4, 6, 11, 18]
# for number in input_number:
#     if number == 1:
#         print(number, 'процент')
#     elif number == 2 or number == 3 or number == 4:
#         print(number, 'процента')
#     else:
#         print(number, 'процентов')
