"""
2. Создать список, состоящий из кубов нечётных чисел от 0 до 1000:
Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7.
Например, число «19 ^ 3 = 6859» будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7.
Внимание: использовать только арифметические операции!
К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого списка,
сумма цифр которых делится нацело на 7. Внимание: новый список не создавать!!!
"""

for s in (0, 17):
    numbers_range = []

    total_summ = 0
    for number in range(1, 1001, 2):
        numbers_range.append((number ** 3) + s)
    # print(numbers_range)
    for numbers in numbers_range:
        _n = numbers
        number_sum = 0
        while numbers:
            number_sum += numbers % 10
            numbers = numbers // 10
        if (number_sum % 7) == 0:
            total_summ += _n
    print(total_summ)